Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00-S1/atdf/PIC32CK2051SG00064S1.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2021 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<!--
CHPMKR VERSION: 2.4.0
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" public="true" xsi:noNamespaceSchemaLocation="https://schemas.microchip.com/com/microchip/atdf/4.5/atdf.xsd">
  <file timestamp="2023-02-20T18:48:28Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
  </variants>
  <devices>
    <device name="PIC32CK2051SG00064S1" architecture="CORTEX-M0PLUS" family="PIC32CK" series="PIC32CKSG00">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="RAM" start="0x10000000" size="0x20000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="ROM" start="0x20000000" size="0x8000" type="rom" rw="R" exec="true"/>
          <memory-segment name="APBA" start="0x50000000" size="0x3000000" type="io" rw="RW"/>
          <memory-segment name="BATTREGS" start="0x53800000" size="0x20" type="ram" rw="RW" exec="true"/>
          <memory-segment name="APBB" start="0x54000000" size="0xC000000" type="io" rw="RW"/>
          <memory-segment name="AUX_INTF" start="0x60000000" size="0x10000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1" caption="None"/>
        <param name="NUM_IRQ" value="3" caption="None"/>
        <param name="__CM0P_REV" value="0x0001" caption="None"/>
        <param name="__MPU_PRESENT" value="0" caption="None"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="None"/>
        <param name="__VTOR_PRESENT" value="1" caption="None"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="None"/>
        <param name="POWER_DOMAIN" value="pd_core"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="AUXINTF" id="DOS03785" name2="DOS03785" version="1a0">
          <instance name="AI">
            <register-group name="AI" name-in-module="AUXINTF" address-space="base" offset="0x57000100"/>
          </instance>
        </module>
        <module name="CSM" id="DOS03785" name2="DOS03785" version="1a0">
          <instance name="CSM">
            <register-group name="CSM" name-in-module="CSM" address-space="base" offset="0x57000000"/>
          </instance>
        </module>
        <module name="EXTDMA" version="1.0.0">
          <instance name="EXTDMA">
            <register-group name="EXTDMA" name-in-module="EXTDMA" address-space="base" offset="0x52000800"/>
          </instance>
        </module>
        <module name="INTCTRL" version="1.0.0">
          <instance name="INTCTRL">
            <register-group name="INTCTRL" name-in-module="INTCTRL" address-space="base" offset="0x52000400"/>
          </instance>
        </module>
        <module name="MAILBOX" version="1.0.0">
          <instance name="MAILBOX">
            <register-group name="MAILBOX" name-in-module="MAILBOX" address-space="base" offset="0x50000000"/>
          </instance>
        </module>
        <module name="MCRAMC" id="drm_mcramc_v3" name2="drm_mcramc_v3" version="3a0">
          <instance name="MCRAMC">
            <register-group name="MCRAMC" name-in-module="MCRAMC" address-space="base" offset="0x57000300"/>
            <parameters>
              <param name="AHB_CLOCK_ENABLE" value="1" caption="MCRAMC CLOCK GATER"/>
              <param name="AHB_ECC" value="1" caption="ECC LOGIC"/>
              <param name="AHB_PORTS_NB" value="1" caption="NUMBER OF AHB PORTS"/>
              <param name="AHB_READ_PREBUFFERING" value="1" caption="AHB READ PREBUFFERING"/>
              <param name="AHB_REQUEST_ISOLATION_REGISTER" value="1" caption="AHB REQUEST TIMING PATHS ISOLATION"/>
              <param name="ARBITRATION_TYPE" value="2" caption="ARBITRATION SCHEME, FIXED_PRIORITY = 0, HIGHLIGHT = 1, HOPSCOTCH = 2"/>
              <param name="BIT_STROBE_RAM" value="0" caption="Set this parameter to TRUE if the ram_wem_bundle outputs are connected to ram bit-strobe write masks"/>
              <param name="CHANNELS_NB" value="1" caption="NUMBER OF RAM CHANNELS"/>
              <param name="ECC_SYNDROM_REGISTER" value="1" caption="ECC TIMING PATH BALANCING"/>
              <param name="HADDR_READ_ISOLATION_REGISTER" value="0" caption="Set to IMPLEMENTED to add 1 wait-state max (0 min) per memory new line read access for each of the AHB timing path isolations"/>
              <param name="HRDATA_ISOLATION_REGISTER" value="1" caption="AHB REQUEST TIMING PATHS ISOLATION"/>
              <param name="MCRAMC_CLK_GATER" value="1" caption="MCRAMC CLOCK GATER"/>
              <param name="MCRAMC_PADDR_SIZE" value="8" caption="APB USER INTERFACE"/>
              <param name="MEMORY_AUTO_CORRECTION" value="1" caption="Perform an automatic write-back of the corrected ram word after read"/>
              <param name="MEMORY_ENABLE_POLARITY" value="0" caption="POSITIVE if Memory is selected when ram_me is 1'b1"/>
              <param name="MW_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="MW_DATA_SIZE" value="32" caption="MW DATA BUS SIZE"/>
              <param name="MW_PORT_SLICES_NB" value="0" caption="NUMBER OF PORT SLICES FOR THE WAITED SRAM INTERFACE"/>
              <param name="M0_CLOCK_ENABLE" value="0" caption="MCRAMC CLOCK GATER"/>
              <param name="M0_DATA_SIZE" value="32" caption="M0 DATA BUS SIZE"/>
              <param name="M0_HYBRID_READ_WRITE_ACCESS" value="0" caption="M0 HYBRID SIMULTANEOUS READ + WRITE ACCESS"/>
              <param name="M0_PORT_SLICES_NB" value="0" caption="NUMBER OF PORT SLICES FOR THE 0 WS SRAM INTERFACE"/>
              <param name="RAM_ADD_SIZE" value="14" caption="NUMBER OF ADDRESS BITS FOR ONE CHANNEL RAM CELL"/>
              <param name="RAM_AHB_ADDRESS_OFFSET" value="0x00000" caption="RAM BLOCK AHB ADDRESS OFFSET"/>
              <param name="STORE_BYTE_STROBE" value="0" caption="AHB byte strobes can be stored and read back through the M0 interface"/>
              <param name="ULTRA" value="1" caption="ULTRA USER INTERFACE"/>
              <param name="WRITE_ENABLE_POLARITY" value="0" caption="POSITIVE if Memory is written when ram_we is 1'b1"/>
              <param name="WRITE_ENABLE_USED" value="0" caption="TRUE  if the Memory makes use of a global per channel ram_we write enable"/>
              <param name="WRITE_MASK_POLARITY" value="0" caption="POSITIVE if Memory is written when ram_wem is 1'b1"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="3" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
