Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00-S1/atdf/PIC32CK2051SG00064S1.atdf
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
      <value-group name="CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
    </module>
    <module name="TAMPER" version="1.0.0" caption="eSecure IP Core Anti-tampering">
      <register-group name="TAMPER" caption="eSecure IP Core Anti-tampering">
        <register name="LEVELA" offset="0x0" rw="R" size="4" initval="0x11111115" caption="Level A">
          <bitfield name="LEVEL0" caption="Level 0" mask="0xF" values="LEVELA__LEVEL0"/>
          <bitfield name="LEVEL1" caption="Level 1" mask="0xF0" values="LEVELA__LEVEL1"/>
          <bitfield name="LEVEL2" caption="Level 2" mask="0xF00" values="LEVELA__LEVEL2"/>
          <bitfield name="LEVEL3" caption="Level 3" mask="0xF000" values="LEVELA__LEVEL3"/>
          <bitfield name="LEVEL4" caption="Level 4" mask="0xF0000" values="LEVELA__LEVEL4"/>
          <bitfield name="LEVEL5" caption="Level 5" mask="0xF00000" values="LEVELA__LEVEL5"/>
          <bitfield name="LEVEL6" caption="Level 6" mask="0xF000000" values="LEVELA__LEVEL6"/>
          <bitfield name="LEVEL7" caption="Level 7" mask="0xF0000000" values="LEVELA__LEVEL7"/>
        </register>
        <register name="LEVELB" offset="0x4" rw="R" size="4" initval="0x11111111" caption="Level B">
          <bitfield name="LEVEL8" caption="Level 8" mask="0xF" values="LEVELB__LEVEL8"/>
          <bitfield name="LEVEL9" caption="Level 9" mask="0xF0" values="LEVELB__LEVEL9"/>
          <bitfield name="LEVEL10" caption="Level 10" mask="0xF00" values="LEVELB__LEVEL10"/>
          <bitfield name="LEVEL11" caption="Level 11" mask="0xF000" values="LEVELB__LEVEL11"/>
          <bitfield name="LEVEL12" caption="Level 12" mask="0xF0000" values="LEVELB__LEVEL12"/>
          <bitfield name="LEVEL13" caption="Level 13" mask="0xF00000" values="LEVELB__LEVEL13"/>
          <bitfield name="LEVEL14" caption="Level 14" mask="0xF000000" values="LEVELB__LEVEL14"/>
          <bitfield name="LEVEL15" caption="Level 15" mask="0xF0000000" values="LEVELB__LEVEL15"/>
        </register>
        <register name="LEVELC" offset="0x8" rw="R" size="4" initval="0x11111111" caption="Level C">
          <bitfield name="LEVEL16" caption="Level 16" mask="0xF" values="LEVELC__LEVEL16"/>
          <bitfield name="LEVEL17" caption="Level 17" mask="0xF0" values="LEVELC__LEVEL17"/>
          <bitfield name="LEVEL18" caption="Level 18" mask="0xF00" values="LEVELC__LEVEL18"/>
          <bitfield name="LEVEL19" caption="Level 19" mask="0xF000" values="LEVELC__LEVEL19"/>
          <bitfield name="LEVEL20" caption="Level 20" mask="0xF0000" values="LEVELC__LEVEL20"/>
          <bitfield name="LEVEL21" caption="Level 21" mask="0xF00000" values="LEVELC__LEVEL21"/>
          <bitfield name="LEVEL22" caption="Level 22" mask="0xF000000" values="LEVELC__LEVEL22"/>
          <bitfield name="LEVEL23" caption="Level 23" mask="0xF0000000" values="LEVELC__LEVEL23"/>
        </register>
        <register name="LEVELD" offset="0xC" rw="R" size="4" initval="0x11111111" caption="Level D">
          <bitfield name="LEVEL24" caption="Level 24" mask="0xF" values="LEVELD__LEVEL24"/>
          <bitfield name="LEVEL25" caption="Level 25" mask="0xF0" values="LEVELD__LEVEL25"/>
          <bitfield name="LEVEL26" caption="Level 26" mask="0xF00" values="LEVELD__LEVEL26"/>
          <bitfield name="LEVEL27" caption="Level 27" mask="0xF000" values="LEVELD__LEVEL27"/>
          <bitfield name="LEVEL28" caption="Level 28" mask="0xF0000" values="LEVELD__LEVEL28"/>
          <bitfield name="LEVEL29" caption="Level 29" mask="0xF00000" values="LEVELD__LEVEL29"/>
          <bitfield name="LEVEL30" caption="Level 30" mask="0xF000000" values="LEVELD__LEVEL30"/>
          <bitfield name="LEVEL31" caption="Level 31" mask="0xF0000000" values="LEVELD__LEVEL31"/>
        </register>
        <register name="SETLEVEL" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Set Level">
          <bitfield name="TamperLevel" caption="Tamper Level" mask="0x7"/>
          <bitfield name="TamperID" caption="Tamper ID" mask="0x1F00"/>
          <bitfield name="ProtectionKey" caption="Protection Key" mask="0xFFFF0000"/>
        </register>
